[
  {
    "id": 1,
    "category": "windows",
    "title": "Task Manager Not Opening",
    "problem": "Clicking Task Manager shows nothing or crashes.",
    "fixes": [
      {
        "title": "Method 1: Keyboard Shortcut",
        "steps": [
          "Press and hold the <kbd>Ctrl</kbd> + <kbd>Shift</kbd> + <kbd>Esc</kbd> keys simultaneously.",
          "This key combination bypasses the Start Menu and should force Task Manager to open directly, even if it's not working normally."
        ]
      },
      {
        "title": "Method 2: System File Checker (SFC)",
        "steps": [
          "Open Command Prompt as an administrator by searching for 'CMD', right-clicking, and selecting 'Run as administrator'.",
          "Type <code>sfc /scannow</code> and press Enter.",
          "This command will scan all protected system files and replace corrupted files with a cached copy. It can often fix issues with built-in Windows applications like Task Manager."
        ]
      }
    ]
  },
  {
    "id": 2,
    "category": "windows",
    "title": "WiFi Connected but No Internet",
    "problem": "WiFi shows connected but websites don't load.",
    "fixes": [
      {
        "title": "Method 1: Reset Winsock Catalog",
        "steps": [
          "Open Command Prompt as an administrator.",
          "Type <code>netsh winsock reset</code> and press Enter.",
          "Restart your computer. This command resets the Windows network stack and can fix many connectivity problems."
        ]
      },
      {
        "title": "Method 2: Change DNS Server",
        "steps": [
          "Open Network and Sharing Center and navigate to your adapter settings.",
          "Right-click your WiFi adapter, go to 'Properties', then 'Internet Protocol Version 4 (TCP/IPv4)'.",
          "Select 'Use the following DNS server addresses' and enter Google's public DNS: <code>8.8.8.8</code> and <code>8.8.4.4</code>. Click OK."
        ]
      }
    ]
  },
  {
    "id": 3,
    "category": "linux",
    "title": "Permission Denied Error",
    "problem": "Cannot write or execute files even as root.",
    "fixes": [
      {
        "title": "Method 1: Check File Ownership",
        "steps": [
          "Use the command <code>ls -l filename</code> to view the file's owner and group.",
          "If the owner or group is not correct, use <code>sudo chown newuser:newgroup filename</code> to change them."
        ]
      },
      {
        "title": "Method 2: Grant Execute Permissions",
        "steps": [
          "If you need to execute the file, use the command <code>sudo chmod +x filename</code>.",
          "To set specific permissions (read, write, execute), use a numerical code (e.g., <code>chmod 755 filename</code> for read/write/execute for owner, read/execute for group/others)."
        ]
      }
    ]
  },
  {
    "id": 4,
    "category": "web",
    "title": "CORS Policy Blocked",
    "problem": "API calls fail with 'Access-Control-Allow-Origin' error.",
    "fixes": [
      {
        "title": "Method 1: Configure Backend Server",
        "steps": [
          "On your backend server (e.g., Node.js, Python Flask), you need to set the appropriate CORS headers in the response.",
          "For a development environment, you can set the header to allow all origins: <code>'Access-Control-Allow-Origin': '*'</code>.",
          "For a production environment, specify the exact domain(s) that should be allowed."
        ]
      },
      {
        "title": "Method 2: Use a Browser Extension (Development Only)",
        "steps": [
          "Install a CORS browser extension (e.g., 'CORS Everywhere' for Firefox or 'Moesif CORS' for Chrome).",
          "Enable the extension to bypass CORS policies locally during development and testing.",
          "Remember to disable it for normal Browse and never rely on this for a production application."
        ]
      }
    ]
  },
  {
    "id": 5,
    "category": "productivity",
    "title": "Slow Startup Time",
    "problem": "Computer takes too long to boot up.",
    "fixes": [
      {
        "title": "Method 1: Disable Startup Programs",
        "steps": [
          "Open Task Manager (Ctrl+Shift+Esc) and go to the 'Startup' tab.",
          "Sort by 'Startup impact' and disable any non-essential programs that are high impact. Right-click and select 'Disable'."
        ]
      },
      {
        "title": "Method 2: Perform Disk Cleanup",
        "steps": [
          "Open the 'Disk Cleanup' tool by searching for it in the Start Menu.",
          "Select the drive you want to clean (usually C:), then click 'Clean up system files'.",
          "This will remove temporary files, old updates, and other clutter that can slow down your system."
        ]
      }
    ]
  },
  {
    "id": 6,
    "category": "windows",
    "title": "Blue Screen of Death (BSOD)",
    "problem": "System crashes unexpectedly with a blue screen.",
    "fixes": [
      {
        "title": "Method 1: Check for Recent Changes",
        "steps": [
          "Think about any hardware you've recently installed or any software/driver updates.",
          "If possible, revert the recent changes. For example, uninstall a recently installed driver or remove a new piece of hardware."
        ]
      },
      {
        "title": "Method 2: Run Windows Memory Diagnostic",
        "steps": [
          "Search for 'Windows Memory Diagnostic' in the Start Menu and run the application.",
          "Choose to restart your computer and let the tool run a scan for issues with your RAM (Random Access Memory).",
          "Faulty RAM is a common cause of unexpected BSOD errors."
        ]
      }
    ]
  },
  {
    "id": 7,
    "category": "linux",
    "title": "Apt-Get Not Working",
    "problem": "Cannot install or update packages using apt-get.",
    "fixes": [
      {
        "title": "Method 1: Check Network Connectivity",
        "steps": [
          "Ensure your computer is connected to the internet. You can use <code>ping 8.8.8.8</code> to test for connectivity.",
          "If there is no connection, check your network configuration or router."
        ]
      },
      {
        "title": "Method 2: Update Package List",
        "steps": [
          "The list of available packages might be out of date. Run the command <code>sudo apt-get update</code> to refresh it.",
          "This command fetches the latest information about packages from your configured repositories."
        ]
      }
    ]
  },
  {
    "id": 8,
    "category": "web",
    "title": "Layout Breaks in Mobile",
    "problem": "Website looks fine on desktop but is broken on mobile.",
    "fixes": [
      {
        "title": "Method 1: Check Media Queries",
        "steps": [
          "Ensure you have a viewport meta tag in your HTML: <code>&lt;meta name='viewport' content='width=device-width, initial-scale=1.0'&gt;</code>.",
          "In your CSS, check for proper media query breakpoints, such as <code>@media (max-width: 768px)</code>, to apply mobile-specific styles."
        ]
      },
      {
        "title": "Method 2: Use Modern Layouts",
        "steps": [
          "Prefer using CSS Flexbox or CSS Grid for layout, as they are designed for responsive and flexible design.",
          "Avoid using older techniques like floats and fixed widths, which are not mobile-friendly."
        ]
      }
    ]
  },
  {
    "id": 9,
    "category": "productivity",
    "title": "Keyboard Shortcuts Not Working",
    "problem": "Common keyboard shortcuts like Ctrl+C fail.",
    "fixes": [
      {
        "title": "Method 1: Restart Applications",
        "steps": [
          "Sometimes, a bug in an application can cause keyboard shortcuts to stop working.",
          "Try closing and reopening the application. If that doesn't work, a full computer restart can often resolve the issue."
        ]
      },
      {
        "title": "Method 2: Check for Conflicting Software",
        "steps": [
          "Certain applications can hijack or override common keyboard shortcuts. This is often the case with clipboard managers or screen capture tools.",
          "Temporarily close any third-party software that might be running in the background and test if the shortcuts work."
        ]
      }
    ]
  },
  {
    "id": 10,
    "category": "windows",
    "title": "Printer Not Responding",
    "problem": "Printer is online but will not print documents.",
    "fixes": [
      {
        "title": "Method 1: Restart All Devices",
        "steps": [
          "Perform a 'power cycle' by turning off your computer, printer, and router. Wait 30 seconds, then turn them back on in the reverse order (router, printer, then computer)."
        ]
      },
      {
        "title": "Method 2: Update Drivers and OS",
        "steps": [
          "Outdated printer drivers or a pending Windows update can cause printing issues.",
          "Check the printer manufacturer's website for the latest drivers or go to Windows Update to ensure your system is up to date."
        ]
      }
    ]
  }
]
